tobozo/ESP32-targz/src/libunpacker/LibUnpacker.cpp
/*\

  MIT License

  Copyright (c) 2020-now tobozo

  Permission is hereby granted, free of charge, to any person obtaining a copy
  of this software and associated documentation files (the "Software"), to deal
  in the Software without restriction, including without limitation the rights
  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  copies of the Software, and to permit persons to whom the Software is
  furnished to do so, subject to the following conditions:

  The above copyright notice and this permission notice shall be included in all
  copies or substantial portions of the Software.

  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
  SOFTWARE.

  ESP32-tgz is a wrapper to uzlib.h and untar.h third party libraries.
  Those libraries have been adapted and/or modified to fit this project's needs
  and are bundled with their initial license files.

  - uzlib: https://github.com/pfalcon/uzlib
  - untar: https://github.com/dsoprea/TinyUntar


  Tradeoffs :
    - speed: fast decompression needs 32Kb memory
    - memory: reducing memory use by dropping the gz_dictionary is VERY slow and prevents tar->gz->filesystem direct streaming
    - space: limited filesystems (<512KB spiffs) need tar->gz->filesystem direct streaming

\*/

#include "LibUnpacker.hpp"

struct TarGzIO
{
  Stream *gz;
  Stream *tar;
  Stream *output;
  size_t gz_size;
  size_t tar_size;
  size_t output_size;
};

TarGzIO tarGzIO;

fs_File untarredFile;
fs_FS *tarFS = nullptr;

TAR::entry_callbacks_t tarCallbacks;

void* (*tgz_malloc)(size_t size) = nullptr;
void* (*tgz_calloc)(size_t n, size_t size) = nullptr;
void* (*tgz_realloc)(void *ptr, size_t size) = nullptr;
bool tgz_use_psram = false;

void   (*tgzLogger)( const char* format, ...) = nullptr;
uint64_t (*fstotalBytes)() = nullptr;
uint64_t (*fsfreeBytes)()  = nullptr;
void   (*fsSetupSizeTools)( fsTotalBytesCb cbt, fsFreeBytesCb cbf ) = nullptr;

void   (*tarProgressCallback)( uint8_t progress ) = nullptr;
void   (*tarMessageCallback)( const char* format, ...) = nullptr;
bool   (*tarSkipThisEntryOut)( TAR::header_translated_t *header ) = nullptr;
bool   (*tarSkipThisEntryIn)( TAR::header_translated_t *header ) = nullptr;
void   (*tarStatusProgressCallback)( const char* name, size_t size, size_t total_unpacked ) = nullptr;
bool   tarSkipThisEntry = false;

void   (*gzMessageCallback)( const char* format, ...) = nullptr;
void   (*gzProgressCallback)( uint8_t progress ) = nullptr;
bool   (*gzWriteCallback)( unsigned char* buff, size_t buffsize ) = nullptr;
unsigned int (*gzReadDestByte)(int offset, unsigned char *out);


const char* tarDestFolder = nullptr;
unsigned char __attribute__((aligned(4))) *output_buffer = nullptr; // gz write buffer
unsigned char *uzlib_gzip_dict = nullptr; // gz dictionnary buffer
struct GZ::TINF_DATA uzLibDecompressor; // uzlib object

tarGzErrorCode _error = ESP32_TARGZ_OK;

bool     targz_halt_on_error = false;
bool     firstblock = true; // for gzProcessTarBuffer
bool     lastblock = false; // for gzProcessTarBuffer
uint32_t targz_read_timeout = 10000; // ms, should be larger than stream timeout
size_t   tarCurrentFileSize = 0;
size_t   tarCurrentFileSizeProgress = 0;
size_t   tarTotalSize = 0;
size_t   min_output_buffer_size = TAR_BLOCK_SIZE;
int32_t  untarredBytesCount = 0;
size_t   totalFiles = 0;
size_t   totalFolders = 0;
int64_t  uzlib_bytesleft = 0;
int64_t  stream_bytesleft = 0;
uint32_t output_position = 0;  // position in output_buffer
uint16_t blockmod = GZIP_BUFF_SIZE / TAR_BLOCK_SIZE; // how many tar blocks can fit in the gzip buffer
uint16_t gzTarBlockPos = 0; // tar block number being decompressed
size_t   tarReadGzStreamBytes = 0;
char*    tar_file_path = nullptr; // temporary storage for filenames
#if defined HAS_OTA_SUPPORT
  bool     tarBlockIsUpdateData = false;
#endif


#if defined ESP32
  bool unTarDoHealthChecks = true; // set to false for faster writes
#elif defined ESP8266 || defined ARDUINO_ARCH_RP2040
  bool unTarDoHealthChecks = false; // ESP8266 is unstable with health checks
  void vTaskDelay(int ms) { delay(ms); }   // ESP8266 has no OS
#else
  bool unTarDoHealthChecks = false;
  void vTaskDelay(int ms) { delay(ms); }
#endif



bool halt_on_error()
{
  return targz_halt_on_error;
}

void targz_system_halt()
{
  log_e("System halted after error code #%d", _error); while(1) { yield(); }
}

void setError( tarGzErrorCode code )
{
  _error = code;
  if( _error != ESP32_TARGZ_OK && halt_on_error() ) targz_system_halt();
}



BaseUnpacker::BaseUnpacker()
{

  fstotalBytes = nullptr;
  fsfreeBytes  = nullptr;
  fsSetupSizeTools = nullptr;
  tarFS = nullptr;
  tarDestFolder = nullptr;
  output_buffer = nullptr;
  _error = ESP32_TARGZ_OK;

  tarCurrentFileSize = 0;
  tarCurrentFileSizeProgress = 0;
  untarredBytesCount = 0;
  totalFiles = 0;
  totalFolders = 0;

  uzlib_gzip_dict = nullptr;
  uzlib_bytesleft = 0;
  stream_bytesleft = 0;
  output_position = 0;  //position in output_buffer
  blockmod = GZIP_BUFF_SIZE / TAR_BLOCK_SIZE;
  gzTarBlockPos = 0;
  tarReadGzStreamBytes = 0;

  tgz_malloc  = malloc;
  tgz_calloc  = calloc;
  tgz_realloc = realloc;
  tgz_use_psram = false;

}


void BaseUnpacker::setReadTimeout( uint32_t read_timeout )
{
  targz_read_timeout = read_timeout;
}

#ifdef ESP32
bool BaseUnpacker::setPsram( bool enable )
{
  if( enable ) {
    if( psramInit() ) {
      tgz_malloc  = ps_malloc;
      tgz_calloc  = ps_calloc;
      tgz_realloc = ps_realloc;
      tgz_use_psram = true;
      log_v("Enabled Psram for uzlib dictionary");
      unTarDoHealthChecks = false;
      return true;
    }
  } else {
    tgz_malloc  = malloc;
    tgz_calloc  = calloc;
    tgz_realloc = realloc;
    log_v("Disabled Psram for uzlib dictionary");
    return true;
  }
  return false;
}
#endif


void BaseUnpacker::setGeneralError( tarGzErrorCode code )
{
  setError( code );
}

