tobozo/ESP32-targz/src/libunpacker/LibUnpacker.cpp
      }
      entry.close();
    }
  }

  void BaseUnpacker::tarGzListDir(fs_FS &fs, const char * dirname, uint8_t levels, bool hexDump)
  {
    //void( hexDump ); // not used (yet?) with ESP82
    Serial.printf("Listing directory %s with level %d\n", dirname, levels);

    File root = fs.open(dirname, fs_file_read);
    if( !root.isDirectory() ){
      log_e( "%s is not a directory", dirname );
      return;
    }
    printDirectory(fs, root, 0, levels, hexDump );
    return;
  }



#endif // defined( ESP8266 )








TarUnpacker::TarUnpacker()
{
  #if __has_include(<PSRamFS.h>)
    log_w("Implicitely disabling health checks on PSRamFS");
    unTarDoHealthChecks = false; // disable that with psramFS
  #endif
  tar_file_path = (char*)malloc(256);
  if( tar_file_path == NULL ) {
    log_e("Failed to allocate 256 bytes, halting");
    targz_halt_on_error = true;
    setError( ESP32_TARGZ_HEAP_TOO_LOW );
  }
}

TarUnpacker::~TarUnpacker()
{
  free( tar_file_path );
}


void TarUnpacker::setTarStatusProgressCallback( tarStatusProgressCb cb )
{
  tarStatusProgressCallback = cb;
}


// set progress callback for TAR
void TarUnpacker::setTarProgressCallback( genericProgressCallback cb )
{
  log_v("Assigning tar progress callback : 0x%8x", (uint)cb );
  tarProgressCallback = cb;
}


// set tar unpacker message callback
void TarUnpacker::setTarMessageCallback( genericLoggerCallback cb )
{
  log_v("Assigning tar message callback : 0x%8x", (uint)cb );
  tarMessageCallback = cb;
}


// exclude / include based on tar header properties (filename, size, type)
void TarUnpacker::setTarExcludeFilter( tarExcludeFilter cb )
{
  log_v("Assigning tar filename exclude filter callback : 0x%8x", (uint)cb );
  tarSkipThisEntryOut = cb;
}
void TarUnpacker::setTarIncludeFilter( tarIncludeFilter cb )
{
  log_v("Assigning tar filename include filter callback : 0x%8x", (uint)cb );
  tarSkipThisEntryIn  = cb;
}


// safer but slower
void TarUnpacker::setTarVerify( bool verify )
{
  log_v("Setting tar verify : %s", verify ? "true" : "false" );
  #if __has_include(<PSRamFS.h>)
    log_d("Implicitely ignoring health checks on PSRamFS");
    unTarDoHealthChecks = false; // disable that with psramFS
  #else
    unTarDoHealthChecks = verify;
  #endif

}




int TarUnpacker::tarHeaderCallBack( TAR::header_translated_t *header,  CC_UNUSED int entry_index,  CC_UNUSED void *context_data )
{
  dump_header(header);

  tarSkipThisEntry = false;

  if( tarSkipThisEntryOut ) {
    if( tarSkipThisEntryOut( header ) ) {
      if(tgzLogger )
        tgzLogger("[TAR] Skipping: %s (filter 'Out' matches)\n", header->filename );
      tarSkipThisEntry = true;
    }
  }

  if( tarSkipThisEntryIn ) {
    if( !tarSkipThisEntryIn( header ) ) {
      if(tgzLogger )
        tgzLogger("[TAR] Skipping: %s (filter 'In' does not match)\n", header->filename );
      tarSkipThisEntry = true;
    }
  }

  // https://github.com/tobozo/ESP32-targz/issues/33
  if( header->type == TAR::T_NORMAL  || header->type == TAR::T_EXTENDED ) {

    if( fstotalBytes &&  fsfreeBytes ) {
      uint64_t freeBytes  = fsfreeBytes();
      if( freeBytes < header->filesize ) {
        // Abort before the partition is smashed!
        log_e("[TAR ERROR] Not enough space left on device (%llu bytes required / %d bytes available)!", header->filesize, freeBytes );
        return ESP32_TARGZ_FS_FULL_ERROR;
      }
    } else {
      #if defined WARN_LIMITED_FS
        log_w("[TAR WARNING] Can't check target medium for free space (required:%llu, free:\?\?), will try to expand anyway", header->filesize );
      #endif
    }

    if( !tarSkipThisEntry ) {
      memset( tar_file_path, 0, 256 );
      // check that TAR path does not start with "./" and truncate if necessary
      if( header->filename[0] == '.' && header->filename[1] == '/' ) {
        #pragma GCC diagnostic push
        #pragma GCC diagnostic ignored "-Wformat-truncation"
        snprintf( tar_file_path, 101, "%s", header->filename ); // TAR paths are limited to 100 chars
        snprintf( header->filename, 101, "%s", &tar_file_path[2] );
        #pragma GCC diagnostic pop
      }
      memset( tar_file_path, 0, 256 );
      if( strcmp( tarDestFolder, FOLDER_SEPARATOR ) != 0 ) {
        // destination folder isn't root folder, prefix !
        strcat(tar_file_path, tarDestFolder);
        // append slash if missing
        if( tarDestFolder[strlen(tarDestFolder)-1] != '/' ) {
          strcat(tar_file_path, FOLDER_SEPARATOR);
        }
      }
      // only append slash if destination folder does not end with a slash
      if( tar_file_path[strlen(tar_file_path)-1] != FOLDER_SEPARATOR[0] ) {
        strcat(tar_file_path, FOLDER_SEPARATOR);
      }

      strcat(tar_file_path, header->filename );

      if( tarFS->exists( tar_file_path ) ) {
        // file will be truncated
        /*
        untarredFile = tarFS->open( file_path, fs_file_read );
        bool isdir = untarredFile.isDirectory();
        untarredFile.close();
        if( isdir ) {
          log_d("[TAR DEBUG] Keeping %s folder", file_path);
        } else {
          log_d("[TAR DEBUG] Deleting %s as it is in the way", file_path);
          tarFS->remove( file_path );
        }
        */
      } else {
        // create directory (recursively if necessary)
        mkdirp( tarFS, tar_file_path );
      }
      //TODO: limit this check to SPIFFS/LittleFS only
      if( strlen( tar_file_path ) > 32 ) {
        // WARNING: SPIFFS LIMIT
        #if defined WARN_LIMITED_FS
          log_w("[TAR WARNING] file path is longer than 32 chars (SPIFFS limit) and may fail: %s", tar_file_path);
          setError( ESP32_TARGZ_TAR_ERR_FILENAME_TOOLONG ); // don't break untar for that
        #endif
      } else {
        log_v("[TAR] Creating %s", tar_file_path);
      }

      untarredFile = tarFS->open(tar_file_path, fs_file_write);
      if(!untarredFile) {
        log_e("[ERROR] in tarHeaderCallBack: Could not open [%s] for write, filesystem full?", tar_file_path);
        setError( ESP32_TARGZ_FS_ERROR );
        return ESP32_TARGZ_FS_ERROR;
      }
      tarGzIO.output = &untarredFile;
    } else {
      log_v("[TAR FILTER] Skipped file/folder creation for: %s.", header->filename);
    }

    tarCurrentFileSize = header->filesize; // for progress
    tarCurrentFileSizeProgress = 0; // for progress

    tarTotalSize += header->filesize;

    if( tarStatusProgressCallback && !tarSkipThisEntry ) {
      tarStatusProgressCallback( header->filename, header->filesize, tarTotalSize );
    }
    if( tarTotalSize == header->filesize && !tarSkipThisEntry )
      tarProgressCallback( 0 );

  } else {

    switch( header->type ) {
      case TAR::T_HARDLINK:       log_v("Ignoring hard link to %s.", header->filename); break;
      case TAR::T_SYMBOLIC:       log_v("Ignoring sym link to %s.", header->filename); break;
      case TAR::T_CHARSPECIAL:    log_v("Ignoring special char."); break;
      case TAR::T_BLOCKSPECIAL:   log_v("Ignoring special block."); break;
      case TAR::T_DIRECTORY:      log_d("Entering %s directory.", header->filename);
        //tarMessageCallback( "Entering %s directory\n", header->filename );
        if( tarStatusProgressCallback && !tarSkipThisEntry ) {
          tarStatusProgressCallback( header->filename, 0, tarTotalSize );
        }
        totalFolders++;
      break;
      case TAR::T_FIFO:           log_v("Ignoring FIFO request."); break;
      case TAR::T_CONTIGUOUS:     log_v("Ignoring contiguous data to %s.", header->filename); break;
      case TAR::T_GLOBALEXTENDED: log_v("Ignoring global extended data."); break;
      //case TAR::T_EXTENDED:       log_d("Ignoring extended data."); break;
      case TAR::T_OTHER: default: log_v("Ignoring unrelevant data.");       break;
    }

