tobozo/ESP32-targz/src/libunpacker/LibUnpacker.cpp
  return 0;
}


// consume and return a byte from the source stream into the argument 'out'.
// returns 0 on success, or -1 on error.
unsigned int GzUnpacker::gzReadSourceByte(CC_UNUSED struct GZ::TINF_DATA *data, unsigned char *out)
{
  _start: // using goto to avoid repeated code blocks
  if (tarGzIO.gz->readBytes( out, 1 ) != 1) {
    uint32_t now = millis();
    uint32_t timeout = now + targz_read_timeout;
    while( !tarGzIO.gz->available() ) {
      if( millis()>timeout ) {
        log_e("gz stream still unresponsive after %dms timeout, giving up", targz_read_timeout);
        return -1;
      }
      vTaskDelay(1); // let the app breathe
    }
    log_d("gz stream was unresponsive during %dms (timeout=%dms)", millis()-now, targz_read_timeout);
    goto _start;
  } else {
    //log_v("read 1 byte: 0x%02x", out[0] );
  }
  if( tarGzIO.gz_size > 0 ) {
    stream_bytesleft -= 1;
  }
  return 0;
}


// gz decompression main routine, handles all logical cases
// isupdate      => zerofill to fit SPI_FLASH_SEC_SIZE
// stream_to_tar => sent bytes to tar instead of filesystem
// use_dict      => change memory usage stragegy
// show_progress => enable/disable bytes count (not always applicable)
int GzUnpacker::gzUncompress( bool isupdate, bool stream_to_tar, bool use_dict, bool show_progress )
{
  if( tgzLogger != targzNullLoggerCallback ) {
    log_d("gzUncompress( isupdate = %s, stream_to_tar = %s, use_dict = %s, show_progress = %s)",
      isupdate      ? "true" : "false",
      stream_to_tar ? "true" : "false",
      use_dict      ? "true" : "false",
      show_progress ? "true" : "false"
    );
  }

  if( !tarGzIO.gz->available() ) {
    log_e("[ERROR] in gzUncompress: gz resource doesn't exist!");
    return ESP32_TARGZ_STREAM_ERROR;
  }

  size_t output_buffer_size =
    #if defined ESP32
      SPI_FLASH_SEC_SIZE // SPI_FLASH_SEC_SIZE = 4Kb
    #elif defined ESP8266 || defined ARDUINO_ARCH_RP2040
      min_output_buffer_size // must be a multiple of 512 (tar block size)
    #else
      4096 // default
    #endif
  ;

  [[maybe_unused]] int32_t progress = 0;
  [[maybe_unused]] size_t updatable_size = 0;
  [[maybe_unused]] size_t zerofill_size  = 0;
  [[maybe_unused]] unsigned int outlen = 0;
  unsigned int return_value = ESP32_TARGZ_OK;
  output_buffer = NULL;

  int uzlib_dict_size = 0;
  int res = 0;

  GZ::uzlib_init();

  if ( use_dict == true && nodict == false ) {

    if( tgz_use_psram ) {
      uzlib_gzip_dict = (unsigned char*)tgz_calloc(1, GZIP_DICT_SIZE);
    } else {
      uzlib_gzip_dict = new unsigned char[GZIP_DICT_SIZE];
    }

    if( uzlib_gzip_dict == NULL ) {
      log_e("[ERROR] can't alloc %d bytes for gzip dict (%d bytes free)", GZIP_DICT_SIZE, HEAP_AVAILABLE() );
      return_value = ESP32_TARGZ_UZLIB_MALLOC_FAIL;
      goto _end;
    }
    uzlib_dict_size = GZIP_DICT_SIZE;
    uzLibDecompressor.readDestByte   = NULL;
    if( tgzLogger != targzNullLoggerCallback ) {
      log_i("[INFO] gzUncompress tradeoff: faster, used %d bytes of ram (heap after alloc: %d)", GZIP_DICT_SIZE+output_buffer_size, HEAP_AVAILABLE());
    }
    //log_w("[%d] alloc() done", HEAP_AVAILABLE() );
  } else {
    if( stream_to_tar ) {
      log_e("[ERROR] gz->tar->filesystem streaming requires a gzip dictionnnary");
      return ESP32_TARGZ_NEEDS_DICT;
    } else {
      uzLibDecompressor.readDestByte   = gzReadDestByte ? gzReadDestByte : gzReadDestByteFS;
      log_v("[INFO] gz output is file");
    }
    //output_buffer_size = SPI_FLASH_SEC_SIZE;
    if( tgzLogger != targzNullLoggerCallback ) {
      log_i("[INFO] gzUncompress tradeoff: slower will use %d bytes of ram (heap before alloc: %d)", output_buffer_size, HEAP_AVAILABLE());
    }
    uzlib_gzip_dict = NULL;
    uzlib_dict_size = 0;
  }

  uzLibDecompressor.source           = nullptr;
  uzLibDecompressor.readSourceByte   = gzReadSourceByte;
  uzLibDecompressor.destSize         = 1;
  uzLibDecompressor.log              = targzPrintLoggerCallback;
  uzLibDecompressor.readSourceErrors = 0;

  res = GZ::uzlib_gzip_parse_header(&uzLibDecompressor);
  if (res != TINF_OK) {
    log_e("[ERROR] in gzUncompress: uzlib_gzip_parse_header failed (response code %d!", res);
    return_value = ESP32_TARGZ_UZLIB_PARSE_HEADER_FAILED;
    //if( halt_on_error() ) targz_system_halt();
    goto _end;
  }

  GZ::uzlib_uncompress_init(&uzLibDecompressor, uzlib_gzip_dict, uzlib_dict_size);

  output_buffer = (unsigned char *)tgz_calloc( output_buffer_size+1, sizeof(unsigned char) );
  if( output_buffer == NULL ) {
    log_e("[ERROR] can't alloc %d bytes for output buffer", output_buffer_size );
    return_value = ESP32_TARGZ_UZLIB_MALLOC_FAIL;
    goto _end;
  }

  /* decompress a single byte at a time */
  output_position = 0;
  outlen = 0;

  if( show_progress ) {
    gzProgressCallback( 0 );
  }

  if( stream_to_tar ) {
    // tar will pull bytes from gz for when needed
    //tinyUntarReadCallback = &tarReadGzStream;
    blockmod = output_buffer_size / TAR_BLOCK_SIZE;
    log_v("[INFO] output_buffer_size=%d blockmod=%d", output_buffer_size, blockmod );
    untarredBytesCount = 0;
    int ret = TAR::tar_setup(&tarCallbacks, NULL);
    firstblock = false;
    if( ret != TAR_OK ) {
      setError( (tarGzErrorCode)(ret-30) );
      return (tarGzErrorCode)(ret-30);
    }
    while( TAR::read_tar_step() == TAR_OK ) yield();
    outlen = untarredBytesCount;

  } else {
    // gz will fill a buffer and trigger a write callback
    do {
      // link to gz internals
      uzLibDecompressor.dest = &output_buffer[output_position];
      res = GZ::uzlib_uncompress_chksum(&uzLibDecompressor);
      if (res != TINF_OK) {
        // uncompress done or aborted, no need to go further
        break;
      }
      output_position++;
      // when destination buffer is filled, write/stream it
      if (output_position == output_buffer_size) {
        log_v("[INFO] Buffer full, now writing %d bytes (total=%d)", output_buffer_size, outlen);
        if( !gzWriteCallback( output_buffer, output_buffer_size ) ) {
          return_value = _error;
          goto _end;
        }


        outlen += output_buffer_size;
        output_position = 0;
      }

      if( show_progress ) {
        if( tarGzIO.output_size > 0 ) {
          uzlib_bytesleft = tarGzIO.output_size - outlen;
          progress = 100*(tarGzIO.output_size-uzlib_bytesleft) / tarGzIO.output_size;
          gzProgressCallback( progress );
        } else if( tarGzIO.gz_size > 0 ) {
          //uzlib_bytesleft = tarGzIO.output_size - outlen;
          //stream_bytesleft = tarGzIO.gz_size -
          progress = 100*(tarGzIO.gz_size-stream_bytesleft) / tarGzIO.gz_size;
          gzProgressCallback( progress );
        }

