tobozo/ESP32-targz/src/libunpacker/LibUnpacker.cpp
      }

    } while ( res == TINF_OK );

    if (res != TINF_DONE) {
      if( uzLibDecompressor.readSourceErrors > 0 ) {
        return_value = ESP32_TARGZ_STREAM_ERROR;
        goto _end;
      }

      log_w("[GZ WARNING] uzlib_uncompress_chksum[type=%s] return code=%d, %d bytes left in output buffer, %d zlib bytes left", TINF_CHKSUM_TYPE(uzLibDecompressor.checksum_type), res, output_position, (int)uzlib_bytesleft);
    }

    // some leftover bytes
    if( output_position > 0 ) {
      if(! gzWriteCallback( output_buffer, output_position ) ) {
        return_value = _error;
        goto _end;
      }
      outlen += output_position;
      output_position = 0;
    }

    if( isupdate && outlen > 0 ) { // Update requirement: written output size must be a multiple of SPI_FLASH_SEC_SIZE
      updatable_size = ( outlen + SPI_FLASH_SEC_SIZE-1 ) & ~( SPI_FLASH_SEC_SIZE-1 );
      zerofill_size  = updatable_size - outlen;
      if( zerofill_size <= SPI_FLASH_SEC_SIZE ) {
        memset( output_buffer, 0, zerofill_size );
        // zero-fill to fit update.h required binary size
        if( ! gzWriteCallback( output_buffer, zerofill_size ) ) {
          return_value = _error;
          goto _end;
        }
        outlen += zerofill_size;
        output_position = 0;
      }
    }

  }

  if( show_progress ) {
    gzProgressCallback( 100 );
  }

  if( tgzLogger != targzNullLoggerCallback ) {
    log_d("decompressed %d bytes", outlen + output_position);
  }

  return_value = outlen > 0 ? ESP32_TARGZ_OK : ESP32_TARGZ_STREAM_ERROR;

  _end:

  if( output_buffer != NULL )
    free( output_buffer );
  gzExpanderCleanup();

  return return_value;
}


// uncompress gz sourceFile to destFile
bool GzUnpacker::gzExpander( fs_FS sourceFS, const char* sourceFile, fs_FS destFS, const char* destFile )
{
  tarGzClearError();
  initFSCallbacks();
  if (!tgzLogger ) {
    setLoggerCallback( targzPrintLoggerCallback );
  }
  bool isupdate      = false;
  bool stream_to_tar = false;
  bool gz_use_dict   = true;
  bool needs_free    = false;

  if( nodict == true ) {
    gz_use_dict = false;
  } else if( HEAP_AVAILABLE() < GZIP_DICT_SIZE+GZIP_BUFF_SIZE ) {
    size_t free_min_heap_blocks = HEAP_AVAILABLE() / 512; // leave 1k heap, eat all the rest !
    if( free_min_heap_blocks <1 ) {
      setError( ESP32_TARGZ_HEAP_TOO_LOW );
      return false;
    }
    min_output_buffer_size = free_min_heap_blocks * 512;
    if( min_output_buffer_size > GZIP_BUFF_SIZE ) min_output_buffer_size = GZIP_BUFF_SIZE;
    log_w("Disabling GZIP Dictionary (heap wanted:%d, available: %d, buffer: %d bytes), writes will be slow", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE, min_output_buffer_size );
    gz_use_dict = false;
    //
  } else {
    log_d("Current heap budget (available:%d, needed:%d)", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE );
  }

  if( destFile == nullptr ) {
    // when no destination name is provided, it will be speculated
    // assumption: the source filename ends with ".gz"
    String sourceFileCopy = String(sourceFile);
    size_t slen = sourceFileCopy.length();
    if( sourceFileCopy.endsWith(".gz") ) {
      slen -= 3;
      sourceFileCopy = sourceFileCopy.substring( 0, slen );
      destFile = (const char*)tgz_calloc( slen+1, sizeof(char) );
      if( destFile == NULL ) {
        setError( ESP32_TARGZ_HEAP_TOO_LOW );
        return false;
      }
      needs_free = true;
      snprintf( (char*)destFile, slen+1, "%s", sourceFileCopy.c_str() );
      log_v("Speculated filename: %s", destFile );
    } else {
      setError( ESP32_TARGZ_TAR_ERR_FILENAME_NOT_GZ );
      return false;
    }
  }

  if(tgzLogger)
    tgzLogger("[GZ] Expanding %s to %s\n", sourceFile, destFile );

  fs_File gz = sourceFS.open( sourceFile, fs_file_read );
  if( !gzProgressCallback ) {
    setGzProgressCallback( defaultProgressCallback );
  }
  if( !gzReadHeader( gz ) ) {
    log_e("[GZ ERROR] in gzExpander: invalid gzip file or not enough space left on device ?");
    gz.close();
    if( needs_free ) free( (char*)destFile );
    setError( ESP32_TARGZ_UZLIB_INVALID_FILE );
    return false;
  }

  if( destFS.exists( destFile ) ) {
    log_v("[GZ INFO] Deleting %s as it is in the way", destFile);
    destFS.remove( destFile );
  }
  fs_File outfile = destFS.open( destFile, fs_file_write );
  if(!outfile) {
    log_e("[GZ ERROR] in gzExpander: cannot create destination file, no space left on device ?");
    gz.close();
    if( needs_free ) free( (char*)destFile );
    setError( ESP32_TARGZ_UZLIB_INVALID_FILE );
    return false;
  }

  tarGzIO.gz = &gz;
  tarGzIO.output = &outfile;
  if( gzWriteCallback == nullptr ) {
    setStreamWriter( gzStreamWriteCallback );
  }
  //gzWriteCallback = &gzStreamWriteCallback; // for regular unzipping

  int ret = gzUncompress( isupdate, stream_to_tar, gz_use_dict );

  outfile.close();
  gz.close();

  if( ret!=0 ) {
    log_e("gzUncompress returned error code %d", ret);
    if( needs_free ) free( (char*)destFile );
    setError( (tarGzErrorCode)ret );
    return false;
  }
  log_v("uzLib expander finished!");

  /*
  outfile = destFS.open( destFile, fs_file_read );
  log_d("Expanded %s to %s (%d bytes)", sourceFile, destFile, outfile.size() );
  outfile.close();
  */
  if( gzMessageCallback ) {
    gzMessageCallback("%s", destFile );
  }

  if( needs_free ) free( (char*)destFile );

  if( fstotalBytes &&  fsfreeBytes ) {
    log_d("[GZ Info] FreeBytes after expansion=%llu", fsfreeBytes() );
  }
  return true;
}



bool GzUnpacker::gzStreamExpander( Stream* sourceStream, fs_FS destFS, const char* destFile ) {
    tarGzClearError();
    initFSCallbacks();
    if (!tgzLogger ) {
        setLoggerCallback( targzPrintLoggerCallback );
    }
    bool isupdate      = false;
    bool stream_to_tar = false;
    bool gz_use_dict   = true;
    bool needs_free    = false;

    if( nodict == true ) {
        gz_use_dict = false;
    } else if( HEAP_AVAILABLE() < GZIP_DICT_SIZE+GZIP_BUFF_SIZE ) {
        size_t free_min_heap_blocks = HEAP_AVAILABLE() / 512; // leave 1k heap, eat all the rest !
        if( free_min_heap_blocks <1 ) {
        setError( ESP32_TARGZ_HEAP_TOO_LOW );
        return false;
        }
        min_output_buffer_size = free_min_heap_blocks * 512;
        if( min_output_buffer_size > GZIP_BUFF_SIZE ) min_output_buffer_size = GZIP_BUFF_SIZE;
        log_w("Disabling GZIP Dictionary (heap wanted:%d, available: %d, buffer: %d bytes), writes will be slow", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE, min_output_buffer_size );
        gz_use_dict = false;
        //
    } else {
        log_d("Current heap budget (available:%d, needed:%d)", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE );
    }

    if( destFile == nullptr ) {
        return false;
    }

    if(tgzLogger)
      tgzLogger("[GZ] Expanding Stream to %s\n", destFile );

    if( !gzProgressCallback ) {
        setGzProgressCallback( defaultProgressCallback );
    }

