tobozo/ESP32-targz/src/libunpacker/LibUnpacker.cpp
    size_t size = sourceStream->available();
    if( ! size ) {
        log_e("Bad stream, aborting");
        setError( ESP32_TARGZ_STREAM_ERROR );
        return false;
    }

    if( destFS.exists( destFile ) ) {
        log_v("[GZ INFO] Deleting %s as it is in the way", destFile);
        destFS.remove( destFile );
    }
    fs_File outFile = destFS.open(destFile, fs_file_write);
    if(!outFile) {
        log_e("[GZ ERROR] in gzExpander: cannot create destination file, no space left on device ?");
        setError( ESP32_TARGZ_UZLIB_INVALID_FILE );
        return false;
    }

    tarGzIO.gz = sourceStream;
    tarGzIO.output = &outFile;

    if( gzWriteCallback == nullptr ) {
        setStreamWriter( gzStreamWriteCallback );
    }
    //gzWriteCallback = &gzStreamWriteCallback; // for regular unzipping

    int ret = gzUncompress( isupdate, stream_to_tar, gz_use_dict );

    outFile.close();

    if( ret!=0 ) {
        log_e("gzUncompress returned error code %d", ret);
        if( needs_free ) free( (char*)destFile );
        setError( (tarGzErrorCode)ret );
        return false;
    }
    log_v("uzLib expander finished!");

    /*
    outfile = destFS.open( destFile, fs_file_read );
    log_d("Expanded %s to %s (%d bytes)", sourceFile, destFile, outfile.size() );
    outfile.close();
    */
    if( gzMessageCallback ) {
        gzMessageCallback("%s", destFile );
    }

    if( needs_free ) free( (char*)destFile );

    if( fstotalBytes &&  fsfreeBytes ) {
        log_d("[GZ Info] FreeBytes after expansion=%d", fsfreeBytes() );
    }
    return true;
}

// uncompress gz stream (file or HTTP) to any destination (see setStreamWriter)
bool GzUnpacker::gzStreamExpander( Stream *stream, size_t gz_size )
{
  if( !gzProgressCallback ) {
    setGzProgressCallback( defaultProgressCallback );
  }
  if( !tgzLogger ) {
    setLoggerCallback( targzPrintLoggerCallback );
  }

  size_t size = stream->available();
  if( ! size ) {
    log_e("Bad stream, aborting");
    setError( ESP32_TARGZ_STREAM_ERROR );
    return false;
  }
  // // TODO: ESP8266 support

  #if defined ESP8266
    log_w("gzStreamExpander() is unstable on ESP8266 (consumes 32KB for Dictionary)");
  #endif

  // #if defined ESP8266 || defined ARDUINO_ARCH_RP2040
  //   log_e("gz stream expanding not implemented on ESP8266/RP2040");
  //   return false;
  // #elif defined ESP32

    bool show_progress = false;
    bool use_dict      = true;
    bool isupdate      = false;
    bool stream_to_tar = false;

    if( HEAP_AVAILABLE() < GZIP_DICT_SIZE+GZIP_BUFF_SIZE ) {
      // log_w("Disabling gzip dictionnary (havailable:%d, needed:%d)", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE );
      log_w("Insufficient heap to decompress (available:%d, needed:%d), aborting", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE );
      setError( ESP32_TARGZ_HEAP_TOO_LOW );
      return false;
    }

    tarGzIO.gz = stream;
    if( gzWriteCallback == nullptr ) {
      setStreamWriter( gzStreamWriteCallback );
    }

    if( int( gz_size ) < 1 || gz_size == 0 ) {
      if(tgzLogger)
        tgzLogger("[GZStreamExpander] unknown binary size\n");
      stream_bytesleft = 0;
    } else {
      if(tgzLogger)
        tgzLogger("[GZStreamExpander] Unzipping\n");
      stream_bytesleft = gz_size;
    }
    // process with unzipping
    int ret = gzUncompress( isupdate, stream_to_tar, use_dict, show_progress );
    // unzipping ended
    if( ret!=0 ) {
      log_e("gzUncompress returned error code %d", ret);
      setError( (tarGzErrorCode)ret );
      return false;
    }
    setError( (tarGzErrorCode)ret );
  //#endif // ifdef ESP32

  return true;
}




#if defined ESP32 || defined ESP8266

  // uncompress gz file to flash (expected to be a valid gzipped firmware)
  bool GzUnpacker::gzUpdater( fs_FS &fs, const char* gz_filename, int partition, bool restart_on_update )
  {
    tarGzClearError();
    initFSCallbacks();
    if (!tgzLogger ) {
      setLoggerCallback( targzPrintLoggerCallback );
    }
    // ESP8266 does not need such check as the unpacker is in the bootloader

    if( !fs.exists( gz_filename )  ) {
      log_e("[ERROR] in gzUpdater: %s does not exist", gz_filename);
      setError( ESP32_TARGZ_UZLIB_INVALID_FILE );
      return false;
    }
    log_v("uzLib SPIFFS Updater start!");
    fs_File gz = fs.open( gz_filename, fs_file_read );
    #if defined ESP8266
      int update_size = gz.size();
    #endif
    #if defined ESP32
      int update_size = UPDATE_SIZE_UNKNOWN;
    #endif
    return gzStreamUpdater( (Stream*)&gz, update_size, partition, restart_on_update );
  }




  // uncompress gz stream (file or HTTP) to flash (expected to be a valid Arduino compiled binary sketch)
  bool GzUnpacker::gzStreamUpdater( Stream *stream, size_t update_size, int partition, bool restart_on_update )
  {
    if( !gzProgressCallback ) {
      setGzProgressCallback( defaultProgressCallback );
    }
    if( !tgzLogger ) {
      setLoggerCallback( targzPrintLoggerCallback );
    }

    size_t size = stream->available();
    if( ! size ) {
      log_e("Bad stream, aborting");
      setError( ESP32_TARGZ_STREAM_ERROR );
      return false;
    }

    #ifdef ESP8266
      // ESP8266 has built-in uzlib so no need to uncompress, just update with gzData
      bool use_buffered_writes = false; // use buffered writes when the gz size is unknown, otherwise use stream writes
      size_t stream_size = 0;

      if( int( update_size ) < 1 ) {
        use_buffered_writes = true;
        stream_size = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
        log_d("Stream size is unknown, aligning update to the partition available size: %d ", stream_size );
      } else {
        Update.runAsync( true );
        stream_size = update_size;
        log_v("Stream size is %d", stream_size );
      }

      if ( !Update.begin( stream_size, partition )) { // U_FLASH or U_PART
        log_e("Can't begin update");
        setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
        return false;
      }

