tobozo/ESP32-targz/src/libunpacker/LibUnpacker.cpp
      if( !use_buffered_writes ) {
        // stream method
        static bool finished = false;
        // async progress
        Update.onProgress([]( size_t done, size_t total ) {
          size_t progress = (100*done)/total;
          if(! finished ) gzProgressCallback( progress );
          if( progress == 100 ) finished = true;
        });
        // walk stream
        while( stream->available() ) {
          if(! Update.writeStream( *stream ) ) {
            log_e("Update couldn't read stream");
            setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
            return false;
          }
          if( finished ) break;
          yield();
        }
      } else {
        // buffered writes method, uses 4KB ram
        // TODO: make this adjustable
        size_t buffsize = 4096;
        uint8_t *buffer = new uint8_t[4096];
        if( !buffer) {
          log_e("Could not allocate %d bytes for stream read", buffsize );
          setError( ESP32_TARGZ_HEAP_TOO_LOW );
          return false;
        }
        uint8_t progress = 0;
        gzProgressCallback( progress );

        while( stream->available() ) {
          size_t len = stream->readBytes( buffer, buffsize );
          if( len < 1 ) break; // end of stream
          if (Update.write(buffer, len) != len) {
            log_e("Updater could not write %d bytes", len );
            setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
            return false;
          } else {
            progress = (Update.progress()*100)/Update.size();
            gzProgressCallback( progress );
          }
          yield();
        }
        if( progress != 100 ) {
          gzProgressCallback( 100 );
        }
        delete buffer;
      }

      if ( !Update.end( true ) ) {
        Update.printError(Serial);
        log_e( "Update Error Occurred. Error #: %u", Update.getError() );
        setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
        return false;
      }

      if ( !Update.isFinished() ) {
        log_e("Update incomplete");
        setError( ESP32_TARGZ_UPDATE_INCOMPLETE );
        return false;
      }

      log_v("Update finished !");
      if( restart_on_update ) ESP.restart();
    #endif // ifdef ESP8266


    #if defined ESP32
      // unfortunately ESP32 doesn't handle gzipped firmware from the bootloader
      bool show_progress = false;
      bool use_dict      = true;
      bool isupdate      = true;
      bool stream_to_tar = false;

      if( HEAP_AVAILABLE() < GZIP_DICT_SIZE+GZIP_BUFF_SIZE ) {
        // log_w("Disabling gzip dictionnary (havailable:%d, needed:%d)", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE );
        log_w("Insufficient heap to decompress (available:%d, needed:%d), aborting", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE );
        setError( ESP32_TARGZ_HEAP_TOO_LOW );
        return false;
      }

      tarGzIO.gz = stream;
      //if( gzWriteCallback == nullptr ) {
        setStreamWriter( gzUpdateWriteCallback );
      //}

      Update.onProgress([]( size_t done, size_t total ) {
        gzProgressCallback( (100*done)/total );
      });

      if( int( update_size ) < 1 || update_size == UPDATE_SIZE_UNKNOWN ) {
        if(tgzLogger)
          tgzLogger("[GZUpdater] Starting update with unknown binary size\n");
        if( !Update.begin( UPDATE_SIZE_UNKNOWN, partition ) ) {
          setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
          return false;
        }
      } else {
        if(tgzLogger)
          tgzLogger("[GZUpdater] Starting update\n");
        if( !Update.begin( ( ( update_size + SPI_FLASH_SEC_SIZE-1 ) & ~( SPI_FLASH_SEC_SIZE-1 ) ), partition ) ) {
          setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
          return false;
        }
      }
      // process with unzipping
      int ret = gzUncompress( isupdate, stream_to_tar, use_dict, show_progress );

      // unzipping ended
      if( ret!=0 ) {
        log_e("gzHTTPUpdater returned error code %d", ret);
        setError( (tarGzErrorCode)ret );
        return false;
      }

      if ( Update.end( true ) ) {
        log_v( "OTA done!" );
        if ( Update.isFinished() ) {
          // yay
          log_v("Update finished !");
          gzProgressCallback( 100 );
          if( restart_on_update ) ESP.restart();
        } else {
          log_e( "Update not finished? Something went wrong!" );
          setError( ESP32_TARGZ_UPDATE_INCOMPLETE );
          return false;
        }
      } else {
        log_e( "Update Error Occurred. Error #: %u", Update.getError() );
        setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
        return false;
      }
      log_v("uzLib filesystem Updater finished!");
      setError( (tarGzErrorCode)ret );
    #endif // ifdef ESP32

    return true;
  }


#endif // defined HAS_OTA_SUPPORT









TarGzUnpacker::TarGzUnpacker() : TarUnpacker(), GzUnpacker()
{

}


// gzWriteCallback
bool TarGzUnpacker::gzProcessTarBuffer( CC_UNUSED unsigned char* buff, CC_UNUSED size_t buffsize )
{
  //stream_bytesleft -= buffsize;

  if( lastblock ) {
    return true;
  }

  if( firstblock ) {
    if( TAR::tar_setup(&tarCallbacks, NULL) == TAR_OK ) {
      firstblock = false;
    } else {
      return false;
    }
  }
  gzTarBlockPos = 0;
  while( gzTarBlockPos < blockmod ) {
    int response = TAR::read_tar_step(); // warn: this may fire more than 1 read_cb()
    if( response == TAR_EXPANDING_DONE ) {
      log_v("[TAR] Expanding done !");
      lastblock = true;
      return true;
    }
    if( gzTarBlockPos > blockmod ) {
      log_e("[ERROR] read_tar_step() fired more too many read_cb()");
      setError( ESP32_TARGZ_TAR_ERR_GZREAD_FAIL );
      return false;
    }
    if( response < 0 ) {
      log_e("[ERROR] gzProcessTarBuffer failed reading %d bytes (buffsize=%d) in gzip block #%d/%d, got response %d", TAR_BLOCK_SIZE, buffsize, gzTarBlockPos%blockmod, blockmod, response);
      setError( ESP32_TARGZ_TAR_ERR_GZREAD_FAIL );
      return false;
    }
  }
  log_v("gz buffer processed by tar (%d steps)", gzTarBlockPos);
  return true;
}


